#print('hello')


# for x in range():
#     y=2**x
#     print(y)


# import numpy
# for x in range(0.0, 0.6, 0.1):
#     y=2**x
#     print(y)


# Ввести три числа m, n, p. Подсчитать количество отрицательных чисел.



# Определить, имеется ли среди трёх чисел a, b и c хотя бы одна пара равных между собой чисел.



# Даны три числа a, b и c. Найти среднее геометрическое этих чисел, если все они отличны от нуля, и среднее арифметическое в противном случае.
